{
  "users": [
    {
      "firstName": "یونس ",
      "lastName": "قربان",
      "mobile": "09361112244",
      "email": "younes.gh@chmail.ir",
      "id": "yshVdDXRBXsUGFYT_qA2E",
      "password": "$2a$10$R8fz.ToHD7G9Opjn4r1poupI83JKsw8yWLUGkmQ.Mju5eD1025vji",
      "userName": "younes71",
      "settings": {
        "job": "برنامه نویس",
        "photo": "https://toplearn.com/img/user/teachers/25033_1593aba2-5cb5-6add-a31f-39e35253dd2a_%DB%8C%D9%88%D9%86%D8%B3_%D9%82%D8%B1%D8%A8%D8%A7%D9%86%DB%8C.jpg",
        "desShort": "",
        "desLong": "من یونس قربان متولد ۱۷۳۱ از شهر مشهد هستم. در رشته برنامه  نویسی کامپیوتر تحصیل کردم و در سال ۷۹۳۱ از مقطع سی ارشد این رشته از دانشگاه فردوسی مشهد فارغ التحصیل شدم",
        "links": {
          "telegram": "",
          "whatsapp": "",
          "instagram": ""
        }
      }
    },
    {
      "firstName": "مرضیه ",
      "lastName": "امینی",
      "mobile": "09158276312",
      "email": "ma.amini.it@gmail.com",
      "id": "_cAd72vpJJfQFtj9OqCdv",
      "password": "$2a$10$uLqYXyIJBkgAwICj2E5FxOm8xutgz9ibXJ7mSB6Wrp/5fVNAoonKe",
      "userName": "mary",
      "settings": {
        "job": "برنامه نویس",
        "photo": "",
        "desShort": "کارشناسی فناوری اطلاعات و  علاقه مند به کوه نوردی",
        "desLong": "من مرضیه امینی متولد ۱۳۷۵ از شهر مشهد هستم. در رشته فناوری اطلاعات  در دانشگاه بین المللی امام رضا تحصیل کردم.  ",
        "links": {
          "telegram": "",
          "whatsapp": "marzeih_amini",
          "instagram": "m.Amini-1997"
        }
      }
    },
    {
      "id": "sEdwsrzfGO5wfR1uU5oI0",
      "mobile": "09158276315",
      "firstName": "بهار",
      "lastName": "امینی",
      "email": "bahar_jan@gmail.vom",
      "userName": "bahar1997",
      "password": "$2a$10$47KZahgO7OHgQf2zAMmdpuFrHl2k56VVLi.py5/p8oukuyMLE7acW",
      "settings": {
        "job": "",
        "photo": "",
        "desShort": "",
        "desLong": "",
        "links": {
          "telegram": "",
          "whatsapp": "",
          "instagram": ""
        }
      }
    }
  ],
  "articles": [
    {
      "authorId": "_cAd72vpJJfQFtj9OqCdv",
      "title": "هليوم",
      "description": "هليوم بستري براي اشتراک گذاري ايده هاو فکر افراد پيشرو در زمينه علم و دانش است. در هليوم ميتوانيد به جديدترين مقالات علمي کشور دسترسي داشته باشيدو خود نيز در ترويج علم و دانش نقشي داشته باشيد.",
      "articleImage": "https://toplearn.com/img/post/%D9%86%D8%B1%D9%85_%D8%A7%D9%81%D8%B2%D8%A7%D8%B1_%D9%85%D8%AA%D9%84%D8%A8_%DA%86%DB%8C%D8%B3%D8%AA_%D9%88_%DA%86%D9%87_%DA%A9%D8%A7%D8%B1%D8%A8%D8%B1%D8%AF%DB%8C_%D8%AF%D8%A7%D8%B1%D8%AF%D8%9F.jpg",
      "createDate": "2024-03-15T11:05:43.026Z",
      "studyTime": "22",
      "tags": "[\"2\"]",
      "id": "Xfeaomq6N0HtLBtiMArMe"
    },
    {
      "authorId": "yshVdDXRBXsUGFYT_qA2E",
      "title": "چگونه آموزش ببینیم؟",
      "description": "همانطور که از عنوان مقاله مشخص است، صحبت ما روی آموزش یک موضوع خاص مثل آموزش از کتاب، ویدئو یا هر آنچه که برای آموزش است نخواهد بود و این مقاله به صورت جامع در مورد چگونگی آموزش دیدن و یادگیری است.\n\n \n\nقبل از هر چیزی باید بدانیم که نمیشه یک روند یا روش خاصی رو برای همه افراد که ذهنیت های متفاوتی هم از هم دارند، در نظر گرفت. ولی خب هدف تمامی این افراد آموزش دیدن و رسیدن به درک عمیقی از اون مطلب است ولی آیا برای تمامی افراد آموزش دیدن به این جا ختم میشود و همه به درک عمیقی از اون مطلب میرسند؟ قطعا خیر. در ادامه به نحوه رسیدن به درک عمیق مطلب، مناسب برای تمامی افراد صحبت خواهیم کرد.\n\n \n\nتا اینجا متوجه شدیم که یک روش خاصی برای چگونه یاد گرفتن مناسب برای همه وجود نداره! اما بعضی روش هایی برای افراد معمول وجود دارند که ما رو میتونن به اون درک عمیقی از اون مطلب برساند که یکی از اون روش ها از در مثال پایین بیان شده است.",
      "articleImage": "https://toplearn.com/img/post/%DA%86%DA%AF%D9%88%D9%86%D9%87_%D8%A2%D9%85%D9%88%D8%B2%D8%B4_%D8%A8%D8%A8%DB%8C%D9%86%DB%8C%D9%85%D8%9F.jpg",
      "createDate": "2024-04-14T17:43:10.898Z",
      "studyTime": 23,
      "tags": "[\"4\",\"3\"]",
      "id": "foW5ihXMJAzshbNvJSgSt"
    },
    {
      "authorId": "yshVdDXRBXsUGFYT_qA2E",
      "title": "چرا باید الکترون (ElectronJS) را یاد بگیریم",
      "description": "فریم ورک الکترون یکی از بهترین فریم ورک های دسکتاپ است، ما در این مطلب قصد داریم به بررسی فریم ورک الکترون و مزایا و معایب آن بپردازیم.\n\nاگر شما هم می خواهید از زبان برنامه نویسی جاوا اسکریپت برای ساخت یک برنامه دسکتاپ استفاده کنید احتمالا یکی از گزینه هایی که به آن فکر کرده اید فریم ورک الکترون است. الکترون که در سال 2013 توسط گیت هاب برای ویرایشگر اتم ایجاد شده بود امروزه توسط بسیاری از شرکت های بزرگ مانند مایکروسافت، دیسکورد و اسلک نیز مورد استفاده قرار می گیرد. ما در این مطلب قصد داریم یک نمای کلی از فریم ورک الکترون را به همراه مزایا و دلایل استفاده از آن به شما ارائه دهیم که بدون شک مطالعه آن برای افرادی که قصد کار کردن با این فریم ورک را دارند مفید و کاربردی خواهد بود.\n\nتاریخچه فریم ورک الکترون\nدر سال 2013 گیت هاب در تلاش بود تا یک ویرایشگر جدید به نام اتم را ایجاد کند. آنها قصد داشتند از فناوری های تحت وب برای تولید و ساخت این ویرایشگر استفاده کنند. متاسفانه در آن زمان ابزارهای مناسبی برای ساخت اپلیکیشن با استفاده از فناوری های وب وجود نداشت. در واقع در آن زمان راهکارهای بسیار کمی برای جاسازی مرورگر وجود داشتند که اکثر آنها نیز به شکل مناسبی طراحی نشده بودند. در نهایت گیت هاب تصمیم گرفت تا ابزار مخصوص به خود را برای این کار بسازد که در ادامه آن را Atom-Shell نامید. حتی زمانی که ویرایشگر اتم توسط ویژوال استودیو کد ضربه سختی خورد این ابزار همچنان موفق شد به سرعت رشد کند. بعدها این ابزار به فریم ورک الکترون تغییر نام پیدا کرد و در حال حاضر نیز با همین نام شناخته می شود.",
      "articleImage": "https://toplearn.com/img/editor/b2b2b69d89a84d348c9b77076e05d288.png",
      "createDate": "2024-04-15T11:05:43.026Z",
      "studyTime": "23",
      "tags": "[\"2\",\"4\",\"3\"]",
      "id": "uyeQk7Aik11V8eyZvE6QK"
    },
    {
      "authorId": "yshVdDXRBXsUGFYT_qA2E",
      "title": "اختلال بیش‌فعالی یا نقص توجه (ADHD)",
      "description": "اختلال بیش‌فعالی یا نقص توجه که به انگلیسی (Attention deficit hyperactivity disorder) و به اختصار ADHD نامیده می شود.  طبق DSM-5 زیر گروه اختلال رشدی عصبی است . و به الگو مداوم بی توجهی و یا بیش فعالی- تکانشگری که با کارکرد یا رشد فرد تداخل دارد اشاره می کند (کارکرد رفتاری فرد و میزان تحرکش مناسب سنش نمی باشد) و عموما رشد این علایم به حدی است که با سطح رشد فرد نا هماهنگ است و می تواند به شکل چشم گیری روی فعالیت های اجتماعی، تحصیلی و شغلی فرد تاثیر مستقیم و منفی بگذارد. ADHD تأثیر منفی بر کیفیت زندگی مرتبط با سلامتی بیمار دارد که ممکن است توسط سایر شرایط روانی مانند اضطراب و افسردگی بیشتر تشدید شود یا خطر ابتلا به آن را افزایش دهد\n\nعلائم این اختلال ناشی از نقص در عملکرد اجرایی  فرد است، و وجود اختلال در تنظیم عاطفی فرد اغلب به‌ عنوان یک علامت اصلی در تشخیص و شناسایی در نظر گرفته می‌شود. در کودکان، مشکلات توجه ممکن است منجر به عملکرد ضعیف در مدرسه شود.  این اختلال با سایر اختلالات عصبی رشدی و روانی و همچنین برخی از اختلالات غیر روانی همراه است که می‌تواند باعث اختلالات مضاعف به خصوص در جامعه مدرن شود. اگرچه افراد مبتلا به ADHD ممکن است برای حفظ توجه بر روی وظایفی که مستلزم (پاداش یا تنبیه تأخیری) هستند، تلاش بسیاری نیاز داشته باشند، با این حال اغلب قادرند برای کارهایی که برایشان جالب یا باارزش است، سطح توجه غیرمعمول طولانی و شدیدی را نشان دهند؛ این مسئله به عنوان  بیش تمرکزی نیز شناخته می شود\n\nلازم به ذکر است که این علائم باید حداقل شش ماه مشاهده شوند و فرد باید قبل از ۱۲ سالگی این علائم را بروز داده باشد و نکته دیگر برای تشخیص این اختلال این امر است که نشانه ها باید در بیش از دو موقعیت یا فعالیت خود را نمایان کرده باشد، باید توجه داشت که اختلال روانی دیگری آن نشانه ها را توجیه نمی کند.",
      "articleImage": "https://files.virgool.io/upload/users/2983268/posts/twvv7zvjv8ox/q2xgdkerzw5t.webp",
      "createDate": "2024-04-17T11:34:04.117Z",
      "studyTime": "33",
      "tags": "[\"3\"]",
      "id": "AE2rponYlS_-mmo0KnH3o"
    },
    {
      "authorId": "sEdwsrzfGO5wfR1uU5oI0",
      "title": "معرفی جامع و کاربردی رشته مهندسی کامپیوتر",
      "description": "رشته مهندسی کامپیوتر یکی از پرطرفدارترین رشته‌های مهندسی در دنیای امروز است. این رشته به مطالعه و طراحی سیستم‌های کامپیوتری و مباحث مرتبط با آن، از جمله سخت‌افزار، نرم‌افزار و شبکه می‌پردازد.\n\nمهندسی کامپیوتر\n\nمهندسی کامپیوتر\n\nمهندسان کامپیوتر نقش کلیدی در توسعه فناوری‌های نوین دارند و در طیف گسترده‌ای از صنایع، از جمله هوافضا، مخابرات، امور مالی و مراقبت‌های بهداشتی، فعالیت می‌کنند. در این مقاله، به معرفی جامع رشته مهندسی کامپیوتر، گرایش‌های مختلف آن، مهارت‌های مورد نیاز برای موفقیت در این رشته، بازار کار و چشم‌انداز آینده آن می‌پردازیم.\n\nمعرفی رشته مهندسی کامپیوتر\n\nمهندسی کامپیوتر به عنوان رشته‌ای تعریف می‌شود که علم و فناوری طراحی، ساخت، پیاده‌سازی و نگهداری نرم‌افزار (Software) و اجزای سخت‌افزاری (Hardware) سیستم‌های محاسباتی مدرن و تجهیزات کنترل شده با کامپیوتر را در بر می‌گیرد.\n\nنرم افزار و سخت افزار\n\nنرم افزار و سخت افزار\n\nمهندسی کامپیوتر به‌طور سنتی به عنوان ترکیبی از علوم کامپیوتر (CS) و مهندسی برق (EE) در نظر گرفته شده است. این رشته در طول سالیان گذشته، به عنوان یک رشته مجزا (اگرچه ارتباط نزدیکی با دیگر رشته‌ها دارد)، تکامل یافته است.\n\nمهندسی کامپیوتر بر اساس نظریه‌ها و اصول محاسبات، ریاضیات، علوم و مهندسی استوار است و این نظریه‌ها و اصول را برای حل مسائل فنی از طریق طراحی سخت‌افزار، نرم‌افزار، شبکه‌ها و فرآیندهای محاسباتی به کار گرفته می‌شوند.\n\nمهندسی کامپیوتر (Computer Engineering) یا به اختصار CpE یا CE شاخه‌ای از مهندسی برق است که چندین رشته از جمله علوم کامپیوتر (Computer Science) و مهندسی الکترونیک (Electronic Engineering) را که برای توسعه سخت‌افزار و نرم‌افزارهای کامپیوتری مورد نیاز است را شامل می‌شود.\n\nمهندسان کامپیوتر معمولا در زمینه‌های مهندسی الکترونیک، مهندسی و طراحی نرم‌افزار و سخت‌افزار آموزش می‌بینند. آنان در بسیاری از جنبه‌های سخت‌افزاری و نرم‌افزاری کامپیوتر، از طراحی ریزکنترلرها، ریزپردازنده‌ها، رایانه‌های شخصی و ابررایانه‌ها گرفته تا طراحی مدارها و برنامه‌ها، درگیر هستند.\n\nاین رشته نه تنها بر نحوه عملکرد سیستم‌های کامپیوتری تمرکز می‌کند، بلکه بر نحوه ادغام و استفاده از آن در ابعاد گسترده‌تر نیز تمرکز دارد. وظایف معمول مهندسین کامپیوتر شامل برنامه‌نویسی نرم‌افزار و میان‌افزار برای میکروکنترلرهای تعبیه‌شده، طراحی تراشه‌های VLSI، طراحی حسگرهای آنالوگ، طراحی مدارهای سیگنال مختلط و طراحی سیستم عامل و بسیاری جنبه‌های دیگر می‌باشد.\nظهور نخستین کامپیوتر (ABC)\n\nبا ظهور تمدن و شکل‌گیری نیازهای جدید، توجه دولت‌ها و مردم به استفاده از ابزارهای محاسباتی شکل گرفت. آن‌ها نیاز به انجام معاملات تجاری، نقشه‌برداری از زمین، مدیریت ذخایر محصولی و نظارت بر چرخه‌های نجومی داشتند.\n\nبرای این کار از زمان‌های قدیم، ابزارهای مختلفی اختراع شد، از چوب‌های شمارش و چرتکه شروع شد و با توسعه علم و فناوری به ماشین حساب‌هایی تبدیل شد که دستگاه‌های محاسباتی از جمله کامپیوترهای شخصی را شامل می‌شوند.\n\nمهندسی کامپیوتر در سال 1939 زمانی که جان وینسنت آتاناسوف و کلیفورد بری شروع به توسعه اولین کامپیوتر دیجیتال الکترونیکی جهان از طریق علوم فیزیک، ریاضیات و مهندسی برق کردند، آغاز شد.\n\nاولین کامپیوتر ABC\n\nاولین کامپیوتر ABC\n\nجان وینسنت آتاناسوف زمانی معلم فیزیک و ریاضیات دانشگاه ایالتی آیووا و کلیفورد بری فارغ التحصیل سابق رشته مهندسی برق و فیزیک بود. آن‌ها با هم کامپیوتر Atanasoff-Berry را ساختند که به نام ABC نیز شناخته می‌شود. ساخت این کامپیوتر که پدر تمامی کامپیوترهای آینده بحساب می‌آید، از سال 1937 تا 1942 طول کشید. بعبارتی تکمیل این کامپیوتر 5 سال طول کشید. در حالیکه ABC اصلی در دهه 1940 برچیده و دور انداخته شد، برای ادای احترام به مخترعان نخستین کامپیوتر جهان، یک کپی از ABC در سال 1997 ساخته شد که در آن تیمی از محققان و مهندسان، چهار سال زمان و حدود 350 هزار دلار هزینه برای ساخت آن صرف کردند. کامپیوترهای شخصی مدرن در دهه 1970 پس از پیشرفت‌هایی در زمینه فناوری نیمه هادی‌ها ظهور کردند.\n\nاولین دوره‌ی آکادمیک مهندسی کامپیوتر در ایالات متحده در سال 1971 و در دانشگاه Case Western Reserve در کلیولند اوهایو تشکیل شد. در سال‌های بعد، با توجه به نیازهای روز افزون شغلی برای مهندسانی که می‌توانند همزمان سخت‌افزار، نرم‌افزار، سیستم عامل و مدیریت انواع سیستم‌های کامپیوتری مورد استفاده در صنعت را مدیریت کنند، برخی مؤسسات عالی در سراسر جهان رشته‌ی مهندسی کامپیوتر در شاخه‌های مختلف را در برنامه خود قرار داده‌اند.\n\nنقش و اهمیت کامپیوتر در دنیای مدرن\n\nدر دنیای مدرن، کامپیوترها نقش بسیار مهمی در تمامی جوانب زندگی ایفا می‌کنند. از ارتباطات تا آموزش، از صنعت تا پزشکی، کامپیوترها و فناوری‌های مرتبط با آن‌ها تاثیر زیادی بر زندگی انسان‌ها دارند.\n\nبا گسترش اینترنت و شبکه‌های اجتماعی، ارتباطات بین افراد و دسترسی به اطلاعات به شکل چشم‌گیری افزایش یافته است. همچنین، پیشرفت‌های علمی و فناوری‌های نوین همچون هوش مصنوعی و رایانش ابری، به بهبود کیفیت زندگی و افزایش بهره‌وری در صنایع مختلف کمک کرده است.\n\nکاربردهای مهندسی کامپیوتر در صنایع مختلف\n\nرشته مهندسی کامپیوتر با توجه به پیشرفت‌های روزافزون فناوری، دارای کاربردهای گسترده‌ای در صنایع مختلف است. در ادامه به بررسی برخی از مهم‌ترین کاربردهای این رشته در صنایع مختلف می‌پردازیم:\n\n1. پزشکی و سلامت\n\n- تشخیص پزشکی مبتنی بر هوش مصنوعی\n\nتوسعه سیستم‌های تشخیص بیماری‌ها و شرایط پزشکی با استفاده از الگوریتم‌های هوش مصنوعی که می‌تواند به تشخیص سریع‌تر و دقیق‌تر بیماری‌ها کمک کند.\n\n- مدیریت بیمارستانی و پرونده‌های پزشکی الکترونیکی\n\nطراحی نرم‌افزارهای مدیریت اطلاعات بیماران و پرونده‌های پزشکی که به بهبود کارایی و دقت در ارائه خدمات پزشکی کمک می‌کند.\n\n- فناوری‌های تصویربرداری پزشکی\n\nتوسعه و بهبود تکنیک‌های تصویربرداری مانند MRI، CT و X-ray با استفاده از پردازش تصویر و الگوریتم‌های پیشرفته.\n\nکاربرد کامپیوتر در پزشکی\n\nکاربرد کامپیوتر در پزشکی\n2. صنایع خودروسازی\n\n- سیستم‌های کنترل اتومبیل‌های خودران\n\nطراحی و توسعه الگوریتم‌ها و سیستم‌های کنترلی برای خودروهای خودران که به افزایش ایمنی و کارایی حمل‌ونقل کمک می‌کند.\n\n- بهینه‌سازی عملکرد موتور و سیستم‌های الکترونیکی خودرو\n\nاستفاده از فناوری‌های پیشرفته برای بهبود کارایی و کاهش مصرف سوخت در خودروها.\n\n- نرم‌افزارهای مدیریت ترافیک و حمل‌ونقل\n\nتوسعه سیستم‌های هوشمند مدیریت ترافیک که به کاهش تراکم ترافیکی و بهبود روانی جریان ترافیک کمک می‌کند.",
      "articleImage": "https://files.virgool.io/upload/users/3106001/posts/ukujssb8rohn/bbly7e1l3qc9.jpg",
      "createDate": "2024-07-10T11:17:01.527Z",
      "studyTime": "160",
      "tags": "[\"1\",\"4\"]",
      "id": "qiHQqDC9dEJfk4hrnJ9F5"
    },
    {
      "authorId": "sEdwsrzfGO5wfR1uU5oI0",
      "title": "دولوپر کیست؟",
      "description": "در این مقاله، به بررسی نقش و اهمیت دولوپرها یا توسعه‌دهندگان نرم‌افزار پرداختیم. دولوپرها افرادی هستند که با استفاده از دانش فنی و خلاقیت خود، نرم‌افزارها و برنامه‌های کاربردی را ایجاد، توسعه و نگهداری می‌کنند.\n\nانواع دولوپر\nدولوپرها به سه دسته اصلی تقسیم می‌شوند:\n\nفرانت‌اند دولوپر: این دولوپرها مسئول طراحی و توسعه رابط‌های کاربری هستند که کاربران با آن‌ها تعامل دارند. آن‌ها با استفاده از HTML، CSS و JavaScript ظاهر و تجربه کاربری سایت‌ها و برنامه‌ها را بهبود می‌بخشند.\nبک‌اند دولوپر: این دسته از دولوپرها بر روی منطق سرور و پایگاه‌های داده کار می‌کنند. آن‌ها کدهایی را توسعه می‌دهند که در سمت سرور اجرا می‌شود و از زبان‌های برنامه‌نویسی مانند Python، Java و PHP برای مدیریت داده‌ها و ایجاد APIها استفاده می‌کنند.\nفول‌استک دولوپر: این دولوپرها توانایی کار بر روی هر دو بخش فرانت‌اند و بک‌اند را دارند و می‌توانند پروژه‌ها را به طور کامل از ابتدا تا انتها پیاده‌سازی کنند. آن‌ها با طیف گسترده‌ای از زبان‌ها و تکنولوژی‌ها آشنا هستند و نقش مهمی در پروژه‌های کوچک و بزرگ ایفا می‌کنند.\nجمع بندی\nبه طور کلی، دولوپرها نقش حیاتی در توسعه و پیشرفت تکنولوژی دارند. آن‌ها با تخصص‌های متنوع خود در زمینه‌های مختلفی مانند توسعه وب، توسعه موبایل، و توسعه سیستم‌های بک‌اند و فرانت‌اند فعالیت می‌کنند. اهمیت و تقاضا برای دولوپرهای ماهر با پیشرفت سریع فناوری روز به روز در حال افزایش است، و این حرفه یکی از پرطرفدارترین و مهم‌ترین حرفه‌های دنیای امروز محسوب می‌شود.",
      "articleImage": "https://files.virgool.io/upload/users/3268187/posts/ksdjm3hcr7sm/0onpwz4ytdkm.jpg",
      "createDate": "2024-07-10T11:25:35.749Z",
      "studyTime": "234",
      "tags": "[\"1\",\"6\",\"7\"]",
      "id": "Wt-ODSywMe8f3IcgdHmJF"
    },
    {
      "authorId": "_cAd72vpJJfQFtj9OqCdv",
      "title": "نقاشی شرلوک هولمز، از نیکیار ممی زاده - Sherlock Holmes Painting",
      "description": "شرح:\nبِیس: ماژیک کیوکالر\nپاستل گچی کِرتاکالر فاین آرت\nمداد رنگی پلی کروم فابرکاستل\nکاغذ اِشتِنباخ",
      "articleImage": "https://files.virgool.io/upload/users/1061536/posts/hh4o4vj0rarr/jlprrprftenp.jpeg",
      "createDate": "2024-07-10T11:42:33.447Z",
      "studyTime": "1",
      "tags": "[\"8\",\"5\"]",
      "id": "hycVHb5Mg8o5_E_b7cOPN"
    }
  ],
  "tags": [
    {
      "id": "1",
      "name": "تکنولوژی"
    },
    {
      "id": "2",
      "name": "داده"
    },
    {
      "id": "3",
      "name": "پزشکی"
    },
    {
      "id": "4",
      "name": "فناوری"
    },
    {
      "id": "5",
      "name": "هنر"
    },
    {
      "id": "6",
      "name": "کامپیوتر"
    },
    {
      "id": "7",
      "name": "مهندسی"
    },
    {
      "id": "8",
      "name": "نقاشی"
    },
    {
      "id": "9",
      "name": "اقتصاد"
    },
    {
      "id": "10",
      "name": "حسابداری"
    }
  ],
  "followers": [
    {
      "id": "npPc0ueruNTkc8qd4Z20I",
      "userId": "_cAd72vpJJfQFtj9OqCdv",
      "authorId": "yshVdDXRBXsUGFYT_qA2E"
    },
    {
      "id": "qE3YSoHb3ziIvDmQCXF7v",
      "userId": "sEdwsrzfGO5wfR1uU5oI0",
      "authorId": "yshVdDXRBXsUGFYT_qA2E"
    },
    {
      "id": "2NUSOEoXdQsDxpNN4cw4R",
      "userId": "_cAd72vpJJfQFtj9OqCdv",
      "authorId": "sEdwsrzfGO5wfR1uU5oI0"
    }
  ],
  "bookmarks": [
    {
      "id": "fMTNmreUafYboWE4Ty4N9",
      "userId": "_cAd72vpJJfQFtj9OqCdv",
      "articleId": "AE2rponYlS_-mmo0KnH3o"
    },
    {
      "id": "IxMuG0TG5wt4wlgO4gKV0",
      "userId": "_cAd72vpJJfQFtj9OqCdv",
      "articleId": "Xfeaomq6N0HtLBtiMArMe"
    },
    {
      "id": "Gikrxq3xEbtAqS19dGTL4",
      "userId": "_cAd72vpJJfQFtj9OqCdv",
      "articleId": "Wt-ODSywMe8f3IcgdHmJF"
    }
  ]
}